СкладГП/src/InformationRegisters/СвойстваПакетов/СвойстваПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвойстваПакетов</name>
  <resources>
    <name>Сечение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СечениеТолщина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СечениеШирина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидПродукции</name>
    <type>
      <types>CatalogRef.ВидыПродукции</types>
    </type>
  </resources>
  <resources>
    <name>Сорт</name>
    <type>
      <types>CatalogRef.Сорта</types>
    </type>
  </resources>
  <resources>
    <name>ТипРаспила</name>
    <type>
      <types>CatalogRef.ТипыРаспила</types>
    </type>
  </resources>
  <resources>
    <name>ДлинаТ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДлинаОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДлинаДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Влажность</name>
    <type>
      <types>CatalogRef.Влажности</types>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Досок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаВыпуска</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Порода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <comment>1 - ОК, 2 - Резерв, 3 - ЗапрещенаОтгрузка, 4 - Поврежден</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Партия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПрефиксПроизводителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>БазаПУ</name>
    <type>
      <types>CatalogRef.БазыПУ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерПакета</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

СкладГП/src/CommonForms/НастройкаШаблонаОписанияПакета/Module.bsl
&НаКлиенте
Процедура Сохранить(Команда)
	Проверить("");
	Если СтрНайти(РезультатПроверки, "ОШИБКИ") = 0 Тогда
		СохранитьНаСервере();
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

Функция ПривестиШаблон()
	Ответ = Новый Структура("Текст, Параметры", "", Новый Массив());
	НачалоПар = 0;
	ПривШаблон  = "";
	Для инд = 1 по СтрДлина(Шаблон) Цикл
		ТекСимвол = Сред(Шаблон,инд,1);
		Если ТекСимвол = "[" Тогда
			ПривШаблон = ПривШаблон + "%"+(Ответ.Параметры.Количество()+1);
			НачалоПар = инд+1;
		ИначеЕсли ТекСимвол = "]" Тогда
			Ответ.Параметры.Добавить(Сред(Шаблон, НачалоПар, инд-НачалоПар));
			НачалоПар = 0;
		Иначе
			Если НачалоПар = 0 Тогда
				ПривШаблон = ПривШаблон + ТекСимвол;	
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
		
	Ответ.Текст = ПривШаблон;
	
	Возврат Ответ;
КонецФУнкции

&НаСервере
Функция ВычислитьШаблон(ДанныеШаблона)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"Выбрать Первые 1
	|"+СтрСоединить(ДанныеШаблона.Параметры,", ")+"
	|ИЗ РегистрСведений.СвойстваПакетов";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	СтрПараметров = "Выборка."+СтрСоединить(ДанныеШаблона.Параметры, ", Выборка.");
	//@skip-check server-execution-safe-mode
	Возврат  Вычислить("СтрШаблон(ДанныеШаблона.Текст,"+СтрПараметров+")"); 
КонецФункции

&НаКлиенте
Процедура Проверить(Команда)
	РезультатПроверки = "";
	ДанныеШаблона = ПривестиШаблон();
	Если ДанныеШаблона.Параметры.Количество() > 0 Тогда
		Попытка
			РезультатПроверки = ВычислитьШаблон(ДанныеШаблона);
		Исключение
			РезультатПроверки = "ОШИБКИ!!";
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьПодсказки();
	ПрочитатьНаСервере()
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	Константы.ШаблонПредставленияПакета.Установить(Шаблон);
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНаСервере()
	Шаблон = Константы.ШаблонПредставленияПакета.Получить();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПодсказки()
	ДоступныеСвойства = ДоступныеСвойства();
	ОписаниеДоступныхСвойств = СтрСоединить(ДоступныеСвойства, ", ");
КонецПроцедуры

&НаКлиенте
Функция ДоступныеСвойства()
	ДоступныеСвойства = Новый Массив;
	ДоступныеСвойства.Добавить("Сечение");
	ДоступныеСвойства.Добавить("СечениеТолщина");
	ДоступныеСвойства.Добавить("СечениеШирина");
	ДоступныеСвойства.Добавить("Сорт");
	ДоступныеСвойства.Добавить("ДлинаТ");
	ДоступныеСвойства.Добавить("Влажность");
	ДоступныеСвойства.Добавить("Досок");
	ДоступныеСвойства.Добавить("Объем");
	ДоступныеСвойства.Добавить("ДатаВыпуска");
	ДоступныеСвойства.Добавить("Порода");
	ДоступныеСвойства.Добавить("ВидПродукции");
	Возврат ДоступныеСвойства
КонецФункции

&НаКлиенте
Процедура ПриИзмененииПараметровЭкрана()
	ОбщегоНазначенияКлиент.ЗаполнитьСвойстваФормыПриИзмененииПараметровЭкрана(ЭтаФорма);
КонецПроцедуры
